In [1]:
import numpy as np
import pandas as pd

In [2]:
data = np.random.rand(10,3)
for col in range(data.shape[1]):
    null_indices = np.random.choice(10,3, replace=False)
    data[null_indices, col] = np.nan
df = pd.DataFrame(data, columns = ['Column_1', 'Column_2', 'Column_3'])
df

   Column_1  Column_2  Column_3
0       NaN       NaN       NaN
1       NaN  0.764020       NaN
2  0.354352  0.930826  0.160802
3       NaN  0.034872       NaN
4  0.790634  0.933835  0.467739
5  0.910697  0.725044  0.334987
6  0.578898       NaN  0.362774
7  0.522493  0.465693  0.819726
8  0.348980       NaN  0.957594
9  0.967588  0.707398  0.219625

In [3]:
# check each column which one is null, is each matrix index is null that's show the true otherwise show the false
pd.isna(df)

   Column_1  Column_2  Column_3
0      True      True      True
1      True     False      True
2     False     False     False
3      True     False      True
4     False     False     False
5     False     False     False
6     False      True     False
7     False     False     False
8     False      True     False
9     False     False     False

In [4]:
# best easyst way to check each column and row, which one is null or store value 

df.isnull()

   Column_1  Column_2  Column_3
0      True      True      True
1      True     False      True
2     False     False     False
3      True     False      True
4     False     False     False
5     False     False     False
6     False      True     False
7     False     False     False
8     False      True     False
9     False     False     False

In [5]:
df.isnull().sum()

Column_1    3
Column_2    3
Column_3    3
dtype: int64

In [6]:
 df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column_1  7 non-null      float64
 1   Column_2  7 non-null      float64
 2   Column_3  7 non-null      float64
dtypes: float64(3)
memory usage: 372.0 bytes

In [8]:
# How to copy a dataset

df1 = df.copy()

In [9]:
# Handling null values

   Column_1  Column_2  Column_3
0       NaN       NaN       NaN
1       NaN  0.764020       NaN
2  0.354352  0.930826  0.160802
3       NaN  0.034872       NaN
4  0.790634  0.933835  0.467739
5  0.910697  0.725044  0.334987
6  0.578898       NaN  0.362774
7  0.522493  0.465693  0.819726
8  0.348980       NaN  0.957594
9  0.967588  0.707398  0.219625

In [10]:
# each null value convert with the some value
df.fillna(0)

   Column_1  Column_2  Column_3
0  0.000000  0.000000  0.000000
1  0.000000  0.764020  0.000000
2  0.354352  0.930826  0.160802
3  0.000000  0.034872  0.000000
4  0.790634  0.933835  0.467739
5  0.910697  0.725044  0.334987
6  0.578898  0.000000  0.362774
7  0.522493  0.465693  0.819726
8  0.348980  0.000000  0.957594
9  0.967588  0.707398  0.219625

In [12]:
df1.fillna(0, inplace=True)

In [13]:
df1

   Column_1  Column_2  Column_3
0  0.000000  0.000000  0.000000
1  0.000000  0.764020  0.000000
2  0.354352  0.930826  0.160802
3  0.000000  0.034872  0.000000
4  0.790634  0.933835  0.467739
5  0.910697  0.725044  0.334987
6  0.578898  0.000000  0.362774
7  0.522493  0.465693  0.819726
8  0.348980  0.000000  0.957594
9  0.967588  0.707398  0.219625

In [14]:
df1.isnull().sum()

Column_1    0
Column_2    0
Column_3    0
dtype: int64

In [15]:
df

   Column_1  Column_2  Column_3
0       NaN       NaN       NaN
1       NaN  0.764020       NaN
2  0.354352  0.930826  0.160802
3       NaN  0.034872       NaN
4  0.790634  0.933835  0.467739
5  0.910697  0.725044  0.334987
6  0.578898       NaN  0.362774
7  0.522493  0.465693  0.819726
8  0.348980       NaN  0.957594
9  0.967588  0.707398  0.219625

In [17]:
df.fillna({ 'Column_1' : 0, 
          'Column_2' : 1, 
          'Column_3' : 2
          })

   Column_1  Column_2  Column_3
0  0.000000  1.000000  2.000000
1  0.000000  0.764020  2.000000
2  0.354352  0.930826  0.160802
3  0.000000  0.034872  2.000000
4  0.790634  0.933835  0.467739
5  0.910697  0.725044  0.334987
6  0.578898  1.000000  0.362774
7  0.522493  0.465693  0.819726
8  0.348980  1.000000  0.957594
9  0.967588  0.707398  0.219625

In [18]:
# default 'how' thake any, mane holo, kono akta row te jodi null value thake oi row ta show korbe na, 
df.dropna()

   Column_1  Column_2  Column_3
2  0.354352  0.930826  0.160802
4  0.790634  0.933835  0.467739
5  0.910697  0.725044  0.334987
7  0.522493  0.465693  0.819726
9  0.967588  0.707398  0.219625

In [20]:
# akta row ar protita value jodi null hoy tahole oi row ta ar show korbe na
df.dropna(how='all')

   Column_1  Column_2  Column_3
1       NaN  0.764020       NaN
2  0.354352  0.930826  0.160802
3       NaN  0.034872       NaN
4  0.790634  0.933835  0.467739
5  0.910697  0.725044  0.334987
6  0.578898       NaN  0.362774
7  0.522493  0.465693  0.819726
8  0.348980       NaN  0.957594
9  0.967588  0.707398  0.219625

In [21]:
# thresh mane holo amar oi row te 'thresh=2' mane thresh soman ba besi notnull hole oi row ta show korbe. 
df.dropna(thresh=2)

   Column_1  Column_2  Column_3
2  0.354352  0.930826  0.160802
4  0.790634  0.933835  0.467739
5  0.910697  0.725044  0.334987
6  0.578898       NaN  0.362774
7  0.522493  0.465693  0.819726
8  0.348980       NaN  0.957594
9  0.967588  0.707398  0.219625

In [23]:
df.dropna(thresh=4)

Empty DataFrame
Columns: [Column_1, Column_2, Column_3]
Index: []

In [24]:
# ai null value gula string value diye oh ami fillip korte pari
df.fillna({ 'Column_1' : 'Learn AI', 
          'Column_2' : 'From Study mart', 
          'Column_3' : 'Data Science'
          })

   Column_1         Column_2      Column_3
0  Learn AI  From Study mart  Data Science
1  Learn AI          0.76402  Data Science
2  0.354352         0.930826      0.160802
3  Learn AI         0.034872  Data Science
4  0.790634         0.933835      0.467739
5  0.910697         0.725044      0.334987
6  0.578898  From Study mart      0.362774
7  0.522493         0.465693      0.819726
8   0.34898  From Study mart      0.957594
9  0.967588         0.707398      0.219625

In [25]:
# replace null value with the mean, median, mode

df

   Column_1  Column_2  Column_3
0       NaN       NaN       NaN
1       NaN  0.764020       NaN
2  0.354352  0.930826  0.160802
3       NaN  0.034872       NaN
4  0.790634  0.933835  0.467739
5  0.910697  0.725044  0.334987
6  0.578898       NaN  0.362774
7  0.522493  0.465693  0.819726
8  0.348980       NaN  0.957594
9  0.967588  0.707398  0.219625

In [27]:
df.fillna(df.mean())

   Column_1  Column_2  Column_3
0  0.639092  0.651670  0.474749
1  0.639092  0.764020  0.474749
2  0.354352  0.930826  0.160802
3  0.639092  0.034872  0.474749
4  0.790634  0.933835  0.467739
5  0.910697  0.725044  0.334987
6  0.578898  0.651670  0.362774
7  0.522493  0.465693  0.819726
8  0.348980  0.651670  0.957594
9  0.967588  0.707398  0.219625

In [28]:
df.mean()

Column_1    0.639092
Column_2    0.651670
Column_3    0.474749
dtype: float64

In [29]:
df.fillna(df.median()) #for outlier

   Column_1  Column_2  Column_3
0  0.578898  0.725044  0.362774
1  0.578898  0.764020  0.362774
2  0.354352  0.930826  0.160802
3  0.578898  0.034872  0.362774
4  0.790634  0.933835  0.467739
5  0.910697  0.725044  0.334987
6  0.578898  0.725044  0.362774
7  0.522493  0.465693  0.819726
8  0.348980  0.725044  0.957594
9  0.967588  0.707398  0.219625

In [30]:
df.median()

Column_1    0.578898
Column_2    0.725044
Column_3    0.362774
dtype: float64

In [31]:
df.fillna(df.mode())

   Column_1  Column_2  Column_3
0  0.348980  0.034872  0.160802
1  0.354352  0.764020  0.219625
2  0.354352  0.930826  0.160802
3  0.578898  0.034872  0.362774
4  0.790634  0.933835  0.467739
5  0.910697  0.725044  0.334987
6  0.578898  0.933835  0.362774
7  0.522493  0.465693  0.819726
8  0.348980       NaN  0.957594
9  0.967588  0.707398  0.219625

In [32]:
df.mode()

   Column_1  Column_2  Column_3
0  0.348980  0.034872  0.160802
1  0.354352  0.465693  0.219625
2  0.522493  0.707398  0.334987
3  0.578898  0.725044  0.362774
4  0.790634  0.764020  0.467739
5  0.910697  0.930826  0.819726
6  0.967588  0.933835  0.957594